app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`updated_at`, `salt`, `remember_token`, `project_id`, `crypted_password`, `created_at`, `remember_token_expires_at`, `name`, `email`, `data_entry_only`, `login`, `is_admin`) VALUES('2012-05-15 16:16:13', '8251a05e93dd18fb2171c39ab0b4cb1f6845ba61', NULL, 1, '80f187f50534efaa6ca390f68e4c7bdc85738833', '2012-05-15 16:16:13', NULL, 'james burrett', 'james@jamesburrett.com', 1, 'james', 0)
---
  def signup
    @user = User.new(params[:user])
    return unless request.post?
    @user.project_id = 7
    @user.data_entry_only = true
    @user.save!