app/controllers/samples_controller.rb

  def index
    if current_user.login == "admin"
      @sample = Sample.find(:all, :order => 'date_submitted' , :include => [:genders, :dna_results, :mt_dnas], :conditions => "project_id = '#{@prid}' and remote_data_entry = true")
---
SELECT * FROM `samples` WHERE (project_id = 1 and approved = false and user_id = '3') ORDER BY concat_ws(',', 'collected_on_year', 'collected_on_month', 'collected_on_day')
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id IN (32,35,71,73,74,76,87,88,89,92,93,94))

  def show
    @sample = Sample.find(params[:id],:include => [:genders, :dna_results, :mt_dnas])
    @sfw = 100
    @org = Organization.find_by_id(@sample.organization_id)
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 32)
SELECT `dna_results`.* FROM `dna_results` WHERE (`dna_results`.sample_id = 32)
SELECT `genders`.* FROM `genders` WHERE (`genders`.sample_id = 32)
SELECT `mt_dnas`.* FROM `mt_dnas` WHERE (`mt_dnas`.sample_id = 32)
SELECT * FROM `organizations` WHERE (`organizations`.`id` = 179214) LIMIT 1

  def edit
    @sample = Sample.find(params[:id])
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 92)

  def update
    @sample = Sample.find(params[:id])
    respond_to do |format|
      if @sample.update_attributes(params[:sample])
---
SELECT * FROM `samples` WHERE (`samples`.`id` = 92)
UPDATE `samples` SET `import_permit` = '', `sample_bc` = '', `export_permit` = '', `current_location` = '', `collected_on_year` = '', `collected_on_day` = '', `collected_on_month` = '', `comments` = '', `text_tissue_type` = '', `organization_id` = '', `field_ident` = '' WHERE `id` = 116